package com.cmdc.ai.assist.constraint

import java.io.File

data class TextToAudioRequest(

    /**
     * 合成的文本，文本长度必须小于1024GBK字节。建议每次请求文本不超过120字节，约为60个汉字或者字母数字。
     * */
    val text: String,
    /**
     *
     * 发音人信息。
     *
     *         免费版本
     *         "小美-标准女主播", "资讯", 0,
     *         "小宇-亲切男声", "对话助手", 1,
     *         "逍遥-情感男声", "小说", 3,
     *         "丫丫-童声", "小说", 4,
     *
     *         付费版本
     *         "逍遥-情感男声", "小说", 5003,
     *         "小鹿-甜美女声", "对话助手", 5118,
     *         "博文-专业男主播", "资讯", 106,
     *         "米朵-可爱童声", "对话助手", 103,
     *         "小童-童声主播", "资讯", 110,
     *         "小萌-软萌妹子", "小说", 111,
     *         "小娇-成熟女主播", "资讯", 5,
     *         "逍遥-情感男声", "小说", 4003,
     *         "博文-专业男主播", "资讯", 4106,
     *         "小贤-电台男主播", "资讯", 4115,
     *         "常盈-电台女主播", "资讯", 5147,
     *         "小皮-萌娃童声", "资讯", 5976,
     *         "皮特-老外男声", "资讯", 5971,
     *         "阿肯-主播男声", "资讯", 4164,
     *         "有为-磁性男声", "资讯", 4176,
     *         "小新-播音女声", "资讯", 4259,
     *         "小鹿-甜美女声", "对话助手", 4119,
     *         "灵儿-清激女声", "对话助手", 4105,
     *         "小乔-活泼女声", "对话助手", 4117,
     *         "晴岚-甜美女声", "对话助手", 4288,
     *         "青川-温柔男声", "对话助手", 4192,
     *         "小雯-活力女主播", "资讯", 4100,
     *         "米朵-可爱女声", "对话助手", 4103,
     *         "姗姗-娱乐女声", "配音", 4144,
     *         "小贝-知识女主播", "资讯", 4278,
     *         "清风-配音男声", "配音", 4143,
     *         "小新-专业女主播", "资讯", 4140,
     *         "小彦-知识男主播", "资讯", 4129,
     *         "星河-广告男声", "配音", 4149,
     *         "小清-广告女声", "配音", 4254,
     *         "博文-综艺男声", "配音", 4206,
     *         "云朵-可爱童声", "配音", 4147,
     *         "婉婉-甜美女声", "配音", 4141,
     *         "南方-电台女主播", "资讯", 4226,
     *         "悠然-旁白男声", "小说", 6205,
     *         "云萱-旁白女声", "小说", 6221,
     *         "清豪-逍遥侠客", "小说", 6546,
     *         "清柔-温柔男神", "小说", 6602,
     *         "雨楠-元气少女", "小说", 6562,
     *         "雨萌-邻家女孩", "小说", 6543,
     *         "书古-情感男声", "小说", 6747,
     *         "书严-沉稳男声", "小说", 6748,
     *         "书道-沉稳男声", "小说", 6746,
     *         "书宁-亲和女声", "小说", 6644,
     *         "小夏-甜美女声", "小说", 4148,
     *         "西贝-脱口秀女声", "配音", 4277,
     *         "阿龙-说书男声", "配音", 4114,
     *         "常悦-民生女主播", "资讯", 5153,
     *         "小乐-可爱童声", "对话助手", 6561,
     *
     *         定制版本
     *         "泽言-温暖男声", "超拟人单情感", 4179,
     *         "禧禧-阳光女声", "超拟人单情感", 4146,
     *         "小柔-温柔女声", "超拟人单情感", 6567,
     *         "言浩-年轻男声", "超拟人单情感", 4156,
     *         "涵竹-开朗女声", "超拟人多情感", 4189,
     *         "嫣然-活泼女声", "超拟人多情感", 4194,
     *         "泽言-开朗男声", "超拟人多情感", 4193,
     *         "怀安-磁性男声", "超拟人多情感", 4195,
     *         "清影-甜美女声", "超拟人多情感", 4196,
     *         "沁遥-知性女声", "超拟人多情感", 4197,
     *         "小粤-粤语女声", "方言", 20100,
     *         "晓芸-粤语女声", "方言", 20101,
     *         "四川小哥-四川男声", "方言", 4257,
     *         "阿闽-闽南男声", "方言", 4132,
     *         "小蓉-四川女声", "方言", 4139,
     *         "台媒女声-台湾女声", "方言", 5977,
     *         "小台-台湾女声", "方言", 4007,
     *         "湘玉-陕西女声", "方言", 4150,
     *         "阿锦-东北女声", "方言", 4134,
     *         "筱林-天津女声", "方言", 4172,
     *         "阿花-上海女声", "方言", 5980,
     *         "老崔-北京男声", "方言", 4154,
     *
     */
    val per: Int? = null,
    /**
     * 语速，取值0-15，默认为5中语速
     * */
    val spd: Int? = null,
    /**
     *音调，取值0-15，默认为5中语调
     * */
    val pit: Int? = null,
    /**
     *音量，基础音库取值0-9，精品音库取值0-15，默认为5中音量（取值为0时为音量最小值，并非为无声）
     * */
    val vol: Int? = null,
    /**
     * 文件格式
     * 3为mp3格式(默认)；
     * 4为pcm-16k；
     * 5为pcm-8k；
     * 6为wav（内容同pcm-16k）
     * 注意aue=4或者6是语音识别要求的格式，但是音频内容不是语音识别要求的自然人发音，所以识别效果会受影响。
     * */
    val aue: Int? = null,

    internal val streaming: Boolean = false,

    )

data class TextToAudioResponse(

    val code: Int? = null,
    val data: File? = null,
    val msg: String? = null,

    )